// localized port names

"ether"                   = "Ethernet";
"multiether"              = "Ethernet %@";
"pci-ether"               = "PCI Ethernet -paikka %@";
"pci-multiether"          = "PCI Ethernet -paikka %@, portti %@";
"usb-ether"               = "USB Ethernet (%@)";
"generic-ether"           = "Ethernet-sovitin (%@)";

"airport"                 = "Wi-Fi";
"generic-wireless"        = "Langaton verkkokortti (%@)";

"firewire"                = "FireWire";
"pci-firewire"            = "PCI FireWire -paikka %@";
"pci-multifirewire"       = "PCI FireWire -paikka %@, portti %@";
"generic-firewire"        = "Ethernet-sovitin (%@)";

"bluetooth"               = "Bluetooth DUN";
"bluetooth-modem"         = "USB Bluetooth -modeemisovitin";
"bluetooth-modem-port"    = "Bluetooth-modeemiportti";
"generic-bluetooth-modem" = "Bluetooth-modeemi (%@)";

"bluetooth-pan"           = "Bluetooth PAN";

"irda"                    = "IrDA";
"irda-ircomm"             = "USB IrDA -modeemisovitin";
"irda-ircomm-port"        = "IrDA-modeemiportti";

"loopback"                = "Silmukka";

"modem"                   = "Sisäinen modeemi";

"modem-port"              = "Modeemiportti";
"modem-printer-port"      = "Modeemi/tulostinportti";

"printer-port"            = "Tulostinportti";
"serial-port"             = "Sarjaportti";

"usbmodem"                = "USB-modeemi"; 
"generic-usbmodem"        = "USB-modeemi (%@)"; 

"wwan"                    = "WWAN"; 

"bond"                    = "Ethernet-sidos (%@)";

"bridge"                  = "Silta (%@)";

"vlan"                    = "VLAN (%@)";

"ipv4"                    = "IPv4";

"l2tp"                    = "L2TP";

"pptp"                    = "PPTP";

"6to4"                    = "6to4";

"ipsec"                   = "IPSec";

"vpn"                     = "VPN (%@)";

// port names (from drivers) that would be good to localize

"External Modem"          = "Ulkoinen modeemi";

"USB Ethernet"            = "USB Ethernet";
"USB Gigabit Ethernet"    = "USB Gigabit Ethernet";

"iPhone"                  = "iPhone USB";

// older ("Built-in", HI changed) localizations

"X-airport"               = "AirPort";
"X-ether"                 = "Sisäinen Ethernet";
"X-multiether"            = "Sisäinen Ethernet %@";
"X-firewire"              = "Sisäinen FireWire";
"X-bluetooth"             = "Bluetooth";
"X-iPhone"                = "iPhone";
